# Data Cleaning with Python and Pandas: Detecting Missing Values

<img src="images/quote.jpg" width=500 height=500 />

## Sources of Missing Values
- User forgot to fill in a field.
- Data was lost while transferring manually from a legacy database.
- There was a programming error.
- Users chose not to fill out a field tied to their beliefs about how the results would be used or interpreted.

**I like to start by asking the following questions:**

- What are the features?
- What are the expected types (int, float, string, boolean)?
- Is there obvious missing data (values that Pandas can detect)?
- Is there other types of missing data that’s not so obvious (can’t easily detect with Pandas)?

In [3]:
# Importing libraries
import pandas as pd
import numpy as np

In [10]:
# Read csv file into a pandas dataframe
df = pd.read_csv("C:/Users/Omar/anaconda/Singularity-Data-Analysis/Data Cleaning with Python and Pandas/data-cleaning-property.csv")

In [12]:
# Take a look at the first few rows
print(df.head(10))

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800
9  100009000.0   215.0     TREMONT            Y           na        2  1800

### what are my features?what are the expected types? 

- ST_NUM: Street number   (float or int)
- ST_NAME: Street name    (string)
- OWN_OCCUPIED: Is the residence owner occupied  Y (“Yes”) or N (“No”)
- NUM_BEDROOMS: Number of bedrooms   (float or int)

In [13]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

# Standard Missing Values
Going back to our original dataset, let’s take a look at the “Street Number” column.

This figure in image show the null cells   <img src="images/st_num.jpg" width=500 height=500 />

In the third row there’s an empty cell. In the seventh row there’s an “NA” value.
Clearly these are both missing values. Let’s see how Pandas deals with these.

In [14]:
# Looking at the ST_NUM column
print(df['ST_NUM'])

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
9    215.0
Name: ST_NUM, dtype: float64

In [15]:
print (df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: ST_NUM, dtype: bool

Taking a look at the column, we can see that Pandas filled in the blank space with “NA”. Using the isnull() method, we can confirm that both the missing value and “NA” were recognized as missing values. Both boolean responses are True.

This is a simple example, but highlights an important point. Pandas will recognize both empty cells and “NA” types as missing values. In the next section, we’ll take a look at some types that Pandas won’t recognize.

# Non-Standard Missing Values
Sometimes it might be the case where there’s missing values that have different formats.

This figure in image show the null cells   <img src="images/num_bedrooms.jpg" width=500 height=500 />

In this column, there’s four missing values.

- n/a
- NA
- —
- na

In [16]:
# Looking at the NUM_BEDROOMS column
print(df['NUM_BEDROOMS'])

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
9     na
Name: NUM_BEDROOMS, dtype: object

In [17]:
print(df['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: NUM_BEDROOMS, dtype: bool

In [9]:
# Making a list of missing value types
missing_values = ['n/a', 'na', '-','--','n.a.','?','NA']

In [10]:
# Read csv file into a pandas dataframe with missing value types
df = pd.read_csv("D:/My Track/Datasets/data-cleaning-property.csv", na_values=missing_values)

In [11]:
df.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0
9  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [12]:
# Looking at the NUM_BEDROOMS column and SQ_FT
print(df['NUM_BEDROOMS'])

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
9    NaN
Name: NUM_BEDROOMS, dtype: float64

In [13]:
print(df['SQ_FT'])

0    1000.0
1       NaN
2     850.0
3     700.0
4    1600.0
5     800.0
6     950.0
7       NaN
8    1800.0
9    1800.0
Name: SQ_FT, dtype: float64

In [14]:
print(df['NUM_BEDROOMS'].isnull(),df['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
9     True
Name: NUM_BEDROOMS, dtype: bool 0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
9     True
Name: NUM_BEDROOMS, dtype: bool

# Unexpected Missing Values

This figure in image show the null cells   <img src="images/own_occupied.jpg" width=500 height=500 />

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

This example is a little more complicated so we’ll need to think through a strategy for detecting these types of missing values. There’s a number of different approaches, but here’s the way that I’m going to work through this one.

In [15]:
# Looking at the OWN_OCCUPIED column
print(df['OWN_OCCUPIED'])
print(df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
9      Y
Name: OWN_OCCUPIED, dtype: object
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: OWN_OCCUPIED, dtype: bool

- Loop through the OWN_OCCUPIED column
- Try and turn the entry into an integer
- If the entry can be changed into an integer, enter a missing value
- If the number can’t be an integer, we know it’s a string, so keep going

Let’s take a look at the code and then we’ll go through it in detail.

In [16]:
# Detecting numbers 
cnt = 0 
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt,'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [17]:
df.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0
9  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

So, we realized that the value of 12 turned into Nun value

In [18]:
print(df.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

Other times we might want to do a quick check to see if we have any missing values at all.

In [19]:
# Any missing values?
print(df.isnull().values.any())

True

We might also want to get a total count of missing values.

In [20]:
print(df.isnull().sum().sum())

12

- Now that we’ve summarized the number of missing values, let’s take a look at doing some simple replacements.

## Replacing
A very common way to replace missing values is using a median.

In [21]:
# Replace the null values in NUM_BEDROOMS column using median 
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [22]:
df['NUM_BEDROOMS'].head(10)

0    3.0
1    3.0
2    2.5
3    1.0
4    3.0
5    2.5
6    2.0
7    1.0
8    2.5
9    2.5
Name: NUM_BEDROOMS, dtype: float64